gongbox/msp430f5529-library/Drivers/src/msp430f5529_timer.c
    return TIMERX[timer]->CCR[ch];
}
/*******************************************************************************
 *  函数名称：TIMER_Capture_CalTime_Us(uint16_t start_value,uint16_t stop_value,uint16_t overflowTime)
 *  功能说明：读取发生捕获时定时器该通道计数值
 *  参数说明：uint16_t start_value  ：捕获起始值
 uint16_t stop_value   ：捕获结束值
 uint16_t overflowTime ：计数器溢出次数
 *  函数返回：
 *  使用例程：uint16 overflowTime;  //定义变量，在定时器溢出中断里对该值增一
 ......
 TIMER_Capture_CalTime_Us(0,TIMER_Capture_GetValue  (TIMER_A0,TIMER_CH1),overflowTime);  //读取发生捕获时的时间
 overflowTime=0;       //清零
 ********************************************************************************/
uint32_t TIMER_Capture_CalTime_Us(uint16_t start_value, uint16_t stop_value,
                                  uint16_t overflowTime)
{
    return (uint32_t) ((((int32_t) stop_value - (int32_t) start_value)
            + (uint32_t) overflowTime * 65536) / g_sClock.SMCLK.fMHZ);
}
/*******************************************************************************
 *  函数名称：TIMER_Timer_Init      (TIMERn timer)
 *  功能说明：计时功能初始化
 *  参数说明：TIMERn timer       ：定时器模块
 *  函数返回：不成功则返回ERROR，成功则返回SUCCESS
 *  使用例程：TIMER_Timer_Init      (TIMER_A1);     //定时器TA1初始化为计时器
 ********************************************************************************/
STATUS TIMER_Timer_Init(TIMERn timer)
{
#ifdef DELAY_TIMER
 ASSERT((timer != DELAY_TIMER),
         "TIMER_Timer_Init",
         "定时器已经设置为默认延时功能，不能再作为其他功能使用");       //不允许这种情况下还宏定义该定时器作为延时所用的定时器，请在system.h里修改DELAY_TIMER宏定义
#endif
    TIMERX[timer]->CLR = BIT_SET;
    TIMERX[timer]->SSEL = TIMER_SSEL_SMCLK;             //这里选择子系统时钟
    TIMERX[timer]->ID = 0u;
    TIMERX[timer]->MC = TIMER_MC_STOP;                  //先停止计数计数
    TIMERX[timer]->IE = RESET;                          //禁止溢出中断

    return SUCCESS;
}
/*******************************************************************************
 *  函数名称：TIMER_Timer_Start(TIMERn timer)
 *  功能说明：计时功能开始计时
 *  参数说明：TIMERn timer       ：定时器模块
 *  函数返回：无
 *  使用例程：TIMER_Timer_Start(TIMER_A1);      //计时器开始计时
 ********************************************************************************/
void TIMER_Timer_Start(TIMERn timer)
{
    TIMERX[timer]->R = 0u;
    TIMERX[timer]->MC = TIMER_MC_CONTINUOUS;
}
/*******************************************************************************
 *  函数名称：TIMER_Timer_Stop (TIMERn timer)
 *  功能说明：计时功能停止计时
 *  参数说明：TIMERn timer       ：定时器模块
 *  函数返回：返回当前计数值
 *  使用例程：TIMER_Timer_Stop (TIMER_A1);   //计时器停止计时
 ********************************************************************************/
uint16_t TIMER_Timer_Stop(TIMERn timer)
{
    TIMERX[timer]->MC = TIMER_MC_STOP;
    return TIMERX[timer]->R;
}
/*******************************************************************************
 *  函数名称：TIMER_Timer_GetTime_Us(TIMERn timer,uint16_t overflowTime)
 *  功能说明：计时时间读取
 *  参数说明：TIMERn timer       ：定时器模块
 uint16_t overflowTime ：计数器溢出次数
 *  函数返回：返回计时时间 （单位：us）
 *  使用例程：int16 overflowTime;  //定义变量，在定时器溢出中断里对该值增一
 ......
 TIMER_Timer_GetTime_Us(TIMAER_A1,overflowTime);  //读取计时时间
 overflowTime=0;       //清零
 ********************************************************************************/
uint32_t TIMER_Timer_GetTime_Us(TIMERn timer, uint16_t overflowTime)
{
    return (uint32_t) ((TIMERX[timer]->R + overflowTime * 65536u)
            / g_sClock.SMCLK.fMHZ);
}
/*******************************************************************************
 *  函数名称：TIMER_Run (TIMERn timer)
 *  功能说明：定时器工作
 *  参数说明：TIMERn timer       ：定时器模块
 *  函数返回：无
 *  使用例程：TIMER_Clear_Counter (TIMAER_A1)；  //启动定时器A1
 ********************************************************************************/
void TIMER_Run(TIMERn timer)
{
    TIMERX[timer]->MC = TIMER_MC_CONTINUOUS;
}
/*******************************************************************************
 *  函数名称：TIMER_Stop (TIMERn timer)
 *  功能说明：定时器工作
 *  参数说明：TIMERn timer       ：定时器模块
 *  函数返回：无
 *  使用例程：TIMER_Stop(TIMAER_A1)；  //停止定时器A1
 ********************************************************************************/
void TIMER_Stop(TIMERn timer)
{
    TIMERX[timer]->MC = TIMER_MC_STOP;
}
/*******************************************************************************
 *  函数名称：TIMER_GetCounterValue (TIMERn timer)
 *  功能说明：读取定时器计数值
 *  参数说明：TIMERn timer  ：定时器模块
 *  函数返回：uint16_t      ：计数值
 *  使用例程：uint16_t value = TIMER_GetCounterValue(TIMAER_A1)；  //读取定时器A1计数值
 ********************************************************************************/
uint16_t TIMER_GetCounterValue(TIMERn timer)
{
    return TIMERX[timer]->R;
}
/*******************************************************************************
 *  函数名称：TIMER_SetCounterValue(TIMERn timer,uint16_t value)
 *  功能说明：设置定时器计数值
 *  参数说明：TIMERn timer       ：定时器模块
 uint16_t value     ：计数值
 *  函数返回：无
 *  使用例程：TIMER_SetCounterValue(TIMAER_A1,0)；  //设置定时器A1计数值为0
 ********************************************************************************/
void TIMER_SetCounterValue(TIMERn timer, uint16_t value)
{
    TIMERX[timer]->R = value;
}
/*******************************************************************************
 *  函数名称：TIMER_GetChannelCounterValue (TIMERn timer,TIMER_CHn ch)
 *  功能说明：读取定时器通道计数值
 *  参数说明：TIMERn timer       ：定时器模块
 TIMER_CHn ch       ：定时器通道             
 *  函数返回：uint16_t value     ：该通道的计数值
 *  使用例程：uint16_t value = TIMER_GetChannelCounterValue(TIMAER_A1,TIMER_CH4)；  //读取定时器A1通道4计数值
 ********************************************************************************/
uint16_t TIMER_GetChannelCounterValue(TIMERn timer, TIMER_CHn ch)
{
    ASSERT((timer==TIMER_A0&&ch<=TIMER_CH4)
            ||(timer==TIMER_A1&&ch<=TIMER_CH2)
            ||(timer==TIMER_A2&&ch<=TIMER_CH2)
            ||(timer==TIMER_B0&&ch<=TIMER_CH6),
            "TIMER_GetChannelCounterValue",
            "定时器通道参数超出范围！"); //断言检测输入参数

    return TIMERX[timer]->CCR[ch];
}
/*******************************************************************************
 *  函数名称：TIMER_SetChannelCounterValue(TIMERn timer,uint16_t value)
 *  功能说明：设置定时器计数值
 *  参数说明：TIMERn timer       ：定时器模块
 TIMER_CHn ch       ：定时器通道
 uint16_t value     ：计数值
 *  函数返回：无
 *  使用例程：TIMER_SetChannelCounterValue(TIMAER_A1,TIMER_CH4,0)；  //设置定时器A1通道4计数值为0
 ********************************************************************************/
void TIMER_SetChannelCounterValue(TIMERn timer, TIMER_CHn ch, uint16_t value)
{
    ASSERT((timer==TIMER_A0&&ch<=TIMER_CH4)
            ||(timer==TIMER_A1&&ch<=TIMER_CH2)
            ||(timer==TIMER_A2&&ch<=TIMER_CH2)
            ||(timer==TIMER_B0&&ch<=TIMER_CH6),
            "TIMER_SetChannelCounterValue",
            "定时器通道参数超出范围！"); //断言检测输入参数

    TIMERX[timer]->CCR[ch] = value;
}
/*******************************************************************************
 *  函数名称：TIMER_GetChannelPinInValue(TIMERn timer, TIMER_CHn ch)
 *  功能说明：获取通道输入值
 *  参数说明：TIMERn timer       ：定时器模块
 TIMER_CHn ch       ：定时器通道
 *  函数返回：STATUS : BIT_SET-输入高电平 RESET-输入低电平
 *  使用例程：STATUS status = TIMER_GetChannelInValue(TIMAER_A1, TIMER_CH1);  //读取定时器A1通道1输入电平
 ********************************************************************************/
STATUS TIMER_GetChannelPinInValue(TIMERn timer, TIMER_CHn ch)
{
    return (TIMERX[timer]->CCTL[ch].CH_CCI) ? BIT_SET : RESET;
}
/*******************************************************************************
 *  函数名称：TIMER_GetChannelPinOutValue(TIMERn timer, TIMER_CHn ch)
 *  功能说明：获取通道输出值
 *  参数说明：TIMERn timer       ：定时器模块
 TIMER_CHn ch       ：定时器通道
 *  函数返回：STATUS : BIT_SET-输出高电平 RESET-输出低电平
 *  使用例程：STATUS status = TIMER_GetChannelOutValue(TIMAER_A1, TIMER_CH1);  //读取定时器A1通道1输出电平
 ********************************************************************************/
STATUS TIMER_GetChannelPinOutValue(TIMERn timer, TIMER_CHn ch)
{
    return (TIMERX[timer]->CCTL[ch].CH_OUT) ? BIT_SET : RESET;
}
/*******************************************************************************
 *  函数名称：TIMER_ITConfig (TIMERn timer,TIMER_IRQn irqn,STATUS ITState)
 *  功能说明：设置是否使能TIMER的某一个中断
 *  参数说明：TIMERn timer       ：定时器模块
 TIMER_IRQn irqn    ：中断事件
 STATUS ITState     ：是否使能中断
 *  函数返回：无
 *  使用例程：TIMER_ITConfig (TIMAER_A1,TIMER_CCR0_IRQn,ENABLE); //使能定时器1通道0中断，即定时中断
 ********************************************************************************/
void TIMER_ITConfig(TIMERn timer, TIMER_IRQn irqn, STATUS ITState)
{
    if (irqn == TIMER_OverFlow_IRQn)
    {
        TIMERX[timer]->IE = ITState;
    }
    else
    {
        TIMERX[timer]->CCTL[irqn].IE = ITState;
    }
}
/*******************************************************************************
 *  函数名称：TIMER_GetITStatus(TIMERn timer,TIMER_IRQn irqn)
 *  功能说明：获取TIMER的某一个中断标志
 *  参数说明：TIMERn timer       ：定时器模块
 TIMER_IRQn irqn    ：中断事件
 *  函数返回：STATUS : TRUE-中断事件发生 FALSE-中断事件未发生
 *  使用例程：if(TRUE == TIMER_GetITStatus(TIMAER_A1,TIMER_CCR1_IRQn)){...} //判断定时器A1通道1中断事件是否发生
 ********************************************************************************/
STATUS TIMER_GetITStatus(TIMERn timer, TIMER_IRQn irqn)
{
    if (irqn == TIMER_OverFlow_IRQn)
    {
        return ((TIMERX[timer]->IFG == BIT_SET) ? TRUE : FALSE);
    }
    else
    {
        return ((TIMERX[timer]->CCTL[irqn].IFG == BIT_SET) ? TRUE : FALSE);
    }
}
/*******************************************************************************
 *  函数名称：TIMER_ClearITPendingBit(TIMERn timer,TIMER_IRQn irqn)
 *  功能说明：清除TIMER的某一个中断标志
 *  参数说明：TIMERn timer       ：定时器模块
 TIMER_IRQn irqn    ：中断事件
 *  函数返回：无
 *  使用例程：TIMER_ClearITPendingBit(TIMAER_A1,TIMER_CCR1_IRQn);   //清除定时器通道1中断标志位
 ********************************************************************************/
void TIMER_ClearITPendingBit(TIMERn timer, TIMER_IRQn irqn)
{
    if (irqn == TIMER_OverFlow_IRQn)
    {
        TIMERX[timer]->IFG = RESET;
    }
    else
    {
        TIMERX[timer]->CCTL[irqn].IFG = RESET;
    }
}
